biddr_api/app/controllers/api/v1/auctions_controller.rb

    def show
        auction = Auction.find(params[:id])
---
SELECT "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

    def create
        auction = Auction.new(auction_params)
        auction.user = User.first
        if auction.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "auctions" ("title", "description", "closing_date", "reserve_price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"